Revit 2017 API
FormattedTextRun Class
 A structure that defines a single run of a formatted text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
[ObsoleteAttribute("This class is obsolete in Revit 2017.")]
public class FormattedTextRun : IDisposable
Visual Basic
<ObsoleteAttribute("This class is obsolete in Revit 2017.")> _
Public Class FormattedTextRun _
	Implements IDisposable
Visual C++
[ObsoleteAttribute(L"This class is obsolete in Revit 2017.")]
public ref class FormattedTextRun : IDisposable
Remarks
A text run identifies a segment of text content with formatting style that does not change for the entire run. In other words, text runs are separated by differences in formatting. However, runs are also separated by tabulators and line-ends, which means that any multi-line text will have number of runs equal or higher than the number of lines even if the text itself has uniform formatting throughout.
A collection of text runs can be obtained from a TextNode by calling GetFormattedTextRuns(). See also: OnText(TextNode) for more details about text output during custom exports.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FormattedTextRun
See Also
FormattedTextRun Members
Autodesk.Revit.DB Namespace